orgua/shepherd-targets/nrf52_rf_survey/trafficbench/target/gpi/arm/nordic/pca10056/platform.c
    // TODO: setup SysTick timer if requested
}

//**************************************************************************************************

// init UART
// TODO: maybe make it a public function in platform.h (params: baudrate, flags (like HW flow control))
// NOTE: if function is inlined and baudrate is constant then it gets well optimized
static inline void uart_init(uint32_t baudrate)
{
    assert(baudrate <= 1000000); // see spec. UARTE features

    // TODO: if enabled: STOPTX/RX

    // disable UART during reconfiguration
    NRF_UARTE0->ENABLE = BV_BY_NAME(UARTE_ENABLE_ENABLE, Disabled);

    // configure pins
    {
#if 1 // CTS = CTS_DEFAULT
  #define CTS_PIN 7
#else // CTS = CTS_OPTIONAL
  #define CTS_PIN 4
#endif

        // TXD, Shepherd-Adaption
        NRF_P0->OUTSET = BV(8);
        NRF_P0->PIN_CNF[8] =
                BV_BY_NAME(GPIO_PIN_CNF_DIR, Output) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
                BV_BY_NAME(GPIO_PIN_CNF_PULL, Disabled) | BV_BY_NAME(GPIO_PIN_CNF_DRIVE, S0S1) |
                BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
        NRF_UARTE0->PSEL.TXD = BV_BY_VALUE(UARTE_PSEL_TXD_PORT, 0) |
                               BV_BY_VALUE(UARTE_PSEL_TXD_PIN, 8) |
                               BV_BY_NAME(UARTE_PSEL_TXD_CONNECT, Connected);

        // RXD, Shepherd-Adaption
        NRF_P0->PIN_CNF[21] =
                BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Connect) |
                BV_BY_NAME(GPIO_PIN_CNF_PULL, Pullup) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
        NRF_UARTE0->PSEL.RXD = BV_BY_VALUE(UARTE_PSEL_RXD_PORT, 0) |
                               BV_BY_VALUE(UARTE_PSEL_RXD_PIN, 21) |
                               BV_BY_NAME(UARTE_PSEL_RXD_CONNECT, Connected);

// RTS
// So far, we do not support flow control in receive direction (= stdin). But:
// ATTENTION: Interface MCU on PCA10056 uses RTS to perform dynamic flow control detection
// (see Dev. Kit User Guide 4440_050 v1.1 section 7.2.1 for details).
// Pull RTS low / high to signal that flow control is used / unused.
#if GPI_ARM_NRF_STDOUT_UART_FLOWCONTROL_MODE
        NRF_P0->OUTCLR = BV(5);
        NRF_P0->PIN_CNF[5] =
                BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Connect) |
                BV_BY_NAME(GPIO_PIN_CNF_PULL, Pulldown) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
#else
        NRF_P0->OUTSET = BV(5);
        NRF_P0->PIN_CNF[5] =
                BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Connect) |
                BV_BY_NAME(GPIO_PIN_CNF_PULL, Pullup) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
#endif
        NRF_UARTE0->PSEL.RTS = BV_BY_NAME(UARTE_PSEL_RTS_CONNECT, Disconnected);

// CTS
#if GPI_ARM_NRF_STDOUT_UART_FLOWCONTROL_MODE
        NRF_P0->PIN_CNF[CTS_PIN] = BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) |
                                   BV_BY_NAME(GPIO_PIN_CNF_INPUT, Connect) |
  #if (GPI_ARM_NRF_STDOUT_UART_FLOWCONTROL_MODE & 2)
                                   BV_BY_NAME(GPIO_PIN_CNF_PULL, Pullup) |
  #else
                                   BV_BY_NAME(GPIO_PIN_CNF_PULL, Pulldown) |
  #endif
                                   BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
        NRF_UARTE0->PSEL.CTS = BV_BY_VALUE(UARTE_PSEL_CTS_PORT, 0) |
                               BV_BY_VALUE(UARTE_PSEL_CTS_PIN, CTS_PIN) |
                               BV_BY_NAME(UARTE_PSEL_CTS_CONNECT, Connected);
#else
        NRF_UARTE0->PSEL.CTS = BV_BY_NAME(UARTE_PSEL_CTS_CONNECT, Disconnected);
#endif
    }

// set UART mode: 8 data bits, 1 stop bit, no parity
#if GPI_ARM_NRF_STDOUT_UART_FLOWCONTROL_MODE
    NRF_UARTE0->CONFIG = BV_BY_NAME(UARTE_CONFIG_HWFC, Enabled) |
                         BV_BY_NAME(UARTE_CONFIG_PARITY, Excluded) |
                         BV_BY_NAME(UARTE_CONFIG_STOP, One);
#else
    NRF_UARTE0->CONFIG = BV_BY_NAME(UARTE_CONFIG_HWFC, Disabled) |
                         BV_BY_NAME(UARTE_CONFIG_PARITY, Excluded) |
                         BV_BY_NAME(UARTE_CONFIG_STOP, One);
#endif

    // set baudrate
    // Unfortunately, the documentation for the register value is very meager.
    // It seems that the baudrate is generated from PCLK16M by an up-counter issuing one tick
    // per overflow and the BAUDRATE register contains the increment value of that counter.
    // The increment can be approximated as BAUDRATE (>)= baudrate * 2^32 / 16000000.
    // It seems that the counter is 20 bit wide (i.e. only the upper bits of BAUDRATE are used).
    // The following posts confirm the observations:
    // https://devzone.nordicsemi.com/f/nordic-q-a/391/uart-baudrate-register-values#post-id-1194
    // https://devzone.nordicsemi.com/f/nordic-q-a/27666/uart-baudrate-nrf52
    switch (baudrate)
    {
        // use official values for common baudrates
        case 1200: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud1200; break;
        case 2400: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud2400; break;
        case 4800: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud4800; break;
        case 9600: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud9600; break;
        case 14400: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud14400; break;
        case 19200: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud19200; break;
        case 28800: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud28800; break;
        case 38400: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud38400; break;
        case 56000: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud56000; break;
        case 57600: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud57600; break;
        case 76800: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud76800; break;
        case 115200: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud115200; break;
        case 230400: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud230400; break;
        case 460800: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud460800; break;
        case 921600: NRF_UARTE0->BAUDRATE = UART_BAUDRATE_BAUDRATE_Baud921600; break;

