orgua/shepherd-targets/nrf52_rf_survey/trafficbench/target/gpi/arm/nordic/pca10056/platform.c
        // approximate other baudrates
        // NOTE: The computation is exact for power-of-two dividers, so we do not need to
        // provide explicit values for baudrates like 31250, 250000, or 1000000.
        default:
        {
            NRF_UARTE0->BAUDRATE = ((UINT64_C(0x100000000) * baudrate) + 8000000) / 16000000;
            break;
        }
    }

// (un)mask interrupts
#if GPI_STDOUT_INTERRUPT_ENABLED
    NRF_UARTE0->INTEN = BV_BY_NAME(UARTE_INTEN_ENDTX, Enabled);
    NVIC_SetPriority(UARTE0_UART0_IRQn, GPI_ARM_NRF_STDIO_INTERRUPT_PRIORITY);
    NVIC_ClearPendingIRQ(UARTE0_UART0_IRQn);
    NVIC_EnableIRQ(UARTE0_UART0_IRQn);
#else
    NRF_UARTE0->INTEN = 0;
#endif

    // start UART
    NRF_UARTE0->ENABLE = BV_BY_NAME(UARTE_ENABLE_ENABLE, Enabled);
}

//**************************************************************************************************
//***** Global Functions ***************************************************************************

void gpi_platform_init()
{
    // GPI_TRACE_FUNCTION -> don't TRACE because HW not ready

    int i;

    // we assume bare-metal programming
    // If there is an underlying OS, the init code needs to be adapted.
    ASSERT_CT(GPI_ARCH_IS_OS(NONE));

    // NOTE: We assume that gpi_platform_init() is called in the init process after a reset event,
    // i.e., most of the registers are assumed to have their reset values. To perform a full system
    // init from an arbitrary state, reset the device manually (e.g. use NVIC_SystemReset() from CMSIS).


    // init (reset) CPU core to defined state
    core_init();

    // enable instruction cache
    // TODO: make that configurable, disable if program runs from RAM
    // NOTE: benefit of cache is application dependent
    // - decreases latency on hit (0 ws.), but increases latency on miss (3 vs. 2 wait states)
    // - can decrease or increase power consumption (with high and low hit rate, respectively)
    // NOTE: it is possible to profile the hit rate, see spec. for details
    NRF_NVMC->ICACHECNF = BV_BY_NAME(NVMC_ICACHECNF_CACHEEN, Enabled) |
                          BV_BY_NAME(NVMC_ICACHECNF_CACHEPROFEN, Disabled);

    // check UICR settings
    // - the settings may be application (not just board) specific -> do not touch them here
    // - PSELRESET is handled in nRF startup code (see CONFIG_NFCT_PINS_AS_GPIOS)
    // - NFCPINS is handled in nRF startup code (see CONFIG_NFCT_PINS_AS_GPIOS)

    // (re)init POWER settings
    NRF_POWER->INTENCLR = -1u;
    NRF_POWER->POFCON   = BV_BY_NAME(POWER_POFCON_POF, Disabled);
    NRF_POWER->DCDCEN   = BV_BY_NAME(POWER_DCDCEN_DCDCEN, Enabled); // set REG1 to DC/DC mode
    NRF_POWER->DCDCEN0 =
            BV_BY_NAME(POWER_DCDCEN0_DCDCEN, Disabled); // set REG0 to DC/DC mode (if enabled)
    for (i = 0; i <= 8; ++i)
        NRF_POWER->RAM[i].POWER =
                0x0000FFFF; // all RAM sections enabled, no retention during System OFF

    // disable watchdog
    // -> not possible if it is running already

    // disable all PPI channels
    NRF_PPI->CHEN              = 0;


    // init I/O ports
    // NOTE: We do this before clock init because the latter takes some time. The goal is to
    // configure all pins into a compatible state as fast as possible to avoid (or at least shorten)
    // any high-current situations.

    // stop HFXO (if running), switch HFCLK to HFINT
    // NOTE: by doing so, we (explicitly) ensure that the CPU runs independent from external
    // signals, which is important while reconfiguring the I/O ports
    //	if (NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_STATE_Msk)
    NRF_CLOCK->TASKS_HFCLKSTOP = 1;

    // set default GPIO config: input, enable pullup or pulldown (for unconnected pins)
    // NOTE: enable pullup or pulldown on unconnected pins to ensure defined logic levels
    // (floating pins can increase power consumption)
    // NOTE: Considering the nRF52840 specification (4413_417 v1.0 Figure 43) it is not clear
    // if the pullup/down is effective / needed when the pad is disconnected (PIN_CNF.INPUT = 0).
    // We enable it for sure.
    // NOTE: PIN_CNF[i].DIR and DIR.PIN[i] reflect the same setting
    for (i = 0; i < 32; ++i)
    {
        NRF_P0->PIN_CNF[i] =
                BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
                BV_BY_NAME(GPIO_PIN_CNF_PULL, Pulldown) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);

        NRF_P1->PIN_CNF[i] =
                BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
                BV_BY_NAME(GPIO_PIN_CNF_PULL, Pulldown) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
    }

    // P0.00 / XL1: [D14 (GPIO)] / XL1 (LFXO in)
    NRF_P0->PIN_CNF[0] =
            BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
            BV_BY_NAME(GPIO_PIN_CNF_PULL, Disabled) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);

    // P0.01 / XL2: [D15 (GPIO)] / XL2 (LFXO out)
    NRF_P0->PIN_CNF[1] =
            BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
            BV_BY_NAME(GPIO_PIN_CNF_PULL, Disabled) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);

    // P0.16: LED1
    // P0.12: LED2
    // P0.03: LED3

    NRF_P0->OUTSET = BV(16) | BV(12) | BV(3);

    NRF_P0->PIN_CNF[3] =
            BV_BY_NAME(GPIO_PIN_CNF_DIR, Output) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
            BV_BY_NAME(GPIO_PIN_CNF_PULL, Disabled) | BV_BY_NAME(GPIO_PIN_CNF_DRIVE, H0D1) |
            BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
    NRF_P0->PIN_CNF[12] =
            BV_BY_NAME(GPIO_PIN_CNF_DIR, Output) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
            BV_BY_NAME(GPIO_PIN_CNF_PULL, Disabled) | BV_BY_NAME(GPIO_PIN_CNF_DRIVE, H0D1) |
            BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);
    NRF_P0->PIN_CNF[16] =
            BV_BY_NAME(GPIO_PIN_CNF_DIR, Output) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Disconnect) |
            BV_BY_NAME(GPIO_PIN_CNF_PULL, Disabled) | BV_BY_NAME(GPIO_PIN_CNF_DRIVE, H0D1) |
            BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);

    // P0.18 / RESET: D29 (GPIO) / RESET
    NRF_P0->PIN_CNF[18] =
            BV_BY_NAME(GPIO_PIN_CNF_DIR, Input) | BV_BY_NAME(GPIO_PIN_CNF_INPUT, Connect) |
            BV_BY_NAME(GPIO_PIN_CNF_PULL, Pullup) | BV_BY_NAME(GPIO_PIN_CNF_SENSE, Disabled);

    // init clock system
    // NOTE: this should be done before initializing other peripherals

