orgua/shepherd-targets/nrf52_rf_survey/trafficbench/target/gpi/arm/nordic/pca10056/platform.c
    // setup:
    // HFCLK: 64MHz from XO (XO running with 32MHz)
    // LFCLK: 32768Hz from XO
    // TIMERx (fast clock): 16MHz from PCLK16M, 32-bit timer
    // RTCx (slow clock): 32768Hz from LFCLK

    // ATTENTION: the CPU is running, so some valid configuration is already there. When we change
    // the settings, we must take care that the CPU keeps running for sure after every single step.
    // Hence, the order of changes has to be designed with care.

    // stop HFXO (if running), implicitly switch HFCLK to HFINT
    //	if (NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_STATE_Msk)
    NRF_CLOCK->TASKS_HFCLKSTOP = 1;

    // stop LFXO (if running)
    //	if (NRF_CLOCK->LFCLKSTAT & CLOCK_LFCLKSTAT_STATE_Msk)
    NRF_CLOCK->TASKS_LFCLKSTOP = 1;

    // init CLOCK module
    NRF_CLOCK->INTENCLR        = -1u;
    NRF_CLOCK->LFCLKSRC        = BV_BY_NAME(CLOCK_LFCLKSRC_SRC, Xtal) |
                          BV_BY_NAME(CLOCK_LFCLKSRC_BYPASS, Disabled) |
                          BV_BY_NAME(CLOCK_LFCLKSRC_EXTERNAL, Disabled);
    NRF_CLOCK->HFXODEBOUNCE        = BV_BY_VALUE(CLOCK_HFXODEBOUNCE_HFXODEBOUNCE, 0x40);

    // start HFXO
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART    = 1;

    // start LFXO
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_LFCLKSTART    = 1;

    // init fast-clock timer
    {
        _gpi_clocks_fast_timer->TASKS_STOP = 1;

        // wait a bit to make sure that STOP gets processed
        // (see spec. 4413_417 v1.0 page 422 "Task delays")
        // ATTENTION: since we stopped the timer, we cannot use it to measure time.
        // Therefore we use some nops here.
        for (i = 4; i-- > 0;) __NOP();

        _gpi_clocks_fast_timer->SHORTS   = 0;
        _gpi_clocks_fast_timer->INTENCLR = -1u;
        _gpi_clocks_fast_timer->MODE     = BV_BY_NAME(TIMER_MODE_MODE, Timer);
        _gpi_clocks_fast_timer->BITMODE  = BV_BY_NAME(TIMER_BITMODE_BITMODE, 32Bit);

        ASSERT_CT(PCLK16_RATE == (PCLK16_RATE / GPI_FAST_CLOCK_RATE) * GPI_FAST_CLOCK_RATE,
                  GPI_FAST_CLOCK_RATE_invalid);
        ASSERT_CT(IS_POWER_OF_2(PCLK16_RATE / GPI_FAST_CLOCK_RATE), GPI_FAST_CLOCK_RATE_invalid);
        ASSERT_CT(MSB(PCLK16_RATE / GPI_FAST_CLOCK_RATE) <= 9, GPI_FAST_CLOCK_RATE_invalid);

        _gpi_clocks_fast_timer->PRESCALER =
                BV_BY_VALUE(TIMER_PRESCALER_PRESCALER, MSB(PCLK16_RATE / GPI_FAST_CLOCK_RATE));

        _gpi_clocks_fast_timer->TASKS_START = 1;
    }

    // init RTC (slow clock)
    {
        _gpi_clocks_rtc->TASKS_STOP = 1;

        // NOTE: The spec. does not mention anything that we have to wait a bit after STOP.
        // If there are any troubles, check again.

        _gpi_clocks_rtc->INTENCLR   = -1u;
        _gpi_clocks_rtc->EVTEN      = BV_BY_VALUE(RTC_EVTENSET_TICK, 1);
        // EVENTS_TICK is needed for ready-polling below and (optionally) VHT

        ASSERT_CT(32768 == (32768 / GPI_SLOW_CLOCK_RATE) * GPI_SLOW_CLOCK_RATE,
                  GPI_SLOW_CLOCK_RATE_invalid);
        ASSERT_CT((32768 / GPI_SLOW_CLOCK_RATE) <= 0x1000, GPI_SLOW_CLOCK_RATE_too_low);

        _gpi_clocks_rtc->PRESCALER   = (32768 / GPI_SLOW_CLOCK_RATE) - 1;

        _gpi_clocks_rtc->TASKS_START = 1;
    }

// if VHT: use PPI to connect RTC->EVENTS_TICK to TIMER->TASKS_CAPTURE
#if GPI_HYBRID_CLOCK_USE_VHT

    NRF_PPI->CH[GPI_ARM_NRF_HYBRID_CLOCK_PPI_CHANNEL].EEP =
            (uintptr_t) & (_gpi_clocks_rtc->EVENTS_TICK);

    NRF_PPI->CH[GPI_ARM_NRF_HYBRID_CLOCK_PPI_CHANNEL].TEP =
            (uintptr_t) &
            (_gpi_clocks_fast_timer->TASKS_CAPTURE[GPI_ARM_NRF_HYBRID_CLOCK_CAPTURE_REG]);

    NRF_PPI->CHENSET = BV(GPI_ARM_NRF_HYBRID_CLOCK_PPI_CHANNEL);

#endif


    // init UART
    // ATTENTION: before using the UART HFCLK must be stable too
    uart_init(GPI_STDOUT_UART_BAUDRATE);


    // wait until clocks are stable
    // ATTENTION: The clocks are not reliable before. However, we can interleave all init tasks
    // that do not rely on clock accuracy.
    // ATTENTION: Since LFCLK may have been unstable when we initialized the RTC (see above),
    // we wait until RTC started up for sure (see spec. 4413_417 v1.0 page 339 START task delay)
    while (!(NRF_CLOCK->EVENTS_HFCLKSTARTED && NRF_CLOCK->EVENTS_LFCLKSTARTED));
    _gpi_clocks_rtc->EVENTS_TICK = 0;
    while (!(_gpi_clocks_rtc->EVENTS_TICK));

// if !VHT: disable RTC->EVENTS_TICK (not needed anymore)
#if !GPI_HYBRID_CLOCK_USE_VHT
    _gpi_clocks_rtc->EVTENCLR = BV_BY_VALUE(RTC_EVTENSET_TICK, 1);
#endif


// init TRACE DSR
#if (GPI_TRACE_MODE_IS_TRACE && GPI_TRACE_USE_DSR)
    NVIC_SetPriority(GPI_TRACE_DSR_IRQ, 0xff);
    NVIC_ClearPendingIRQ(GPI_TRACE_DSR_IRQ);
    NVIC_EnableIRQ(GPI_TRACE_DSR_IRQ);
#endif


    // GPI_TRACE_RETURN();
}

//**************************************************************************************************

void gpi_sleep()
{
    // disable interrupts, set PRIMASK = 1
    gpi_int_disable();

    // mark that CPU comes from power-down
    // this flag can be evaluated by the application
    // NOTE: to be meaningful, the first ISR taken after power-up should clear it
    gpi_wakeup_event = 1;

    // set control registers such that CPU will wake-up but not enter ISR, i.e., program returns here
    // (see ARM Cortex-M4 Generic User Guide (DUI 0553A ID121610) "2.5.2 Wakeup from sleep mode" for details)
    // NOTE: PRIMASK has already been set to 1 by gpi_int_disable() above
    //	__set_FAULTMASK(0);
    //	__set_PRIMASK(1);

    // enter power-down (if no IRQ pending)
    // NOTE: enabled interrupts work as wake-up events even if PRIMASK = 0
    // NOTE: SCR settings are assumed to be configured by the application (fitting her needs)
    __WFI();

    // sleep...

    // restore standard behavior
    // NOTE: PRIMASK = 0 reenables interrupts. In consequence, pending IRQ(s) will be taken.
    __set_PRIMASK(0);
}

//**************************************************************************************************

