orgua/shepherd-targets/nrf52_rf_survey/trafficbench/target/gpi/arm/nordic/pca10056/platform.c
void gpi_nrf_uicr_erase()
{
    // set erase-enable mode
    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
    NRF_NVMC->CONFIG = BV_BY_NAME(NVMC_CONFIG_WEN, Een);

    // erase UICR
    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
    NRF_NVMC->ERASEUICR = BV_BY_NAME(NVMC_ERASEUICR_ERASEUICR, Erase);

    // go back to read-only mode
    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
    NRF_NVMC->CONFIG = BV_BY_NAME(NVMC_CONFIG_WEN, Ren);

    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
}

//**************************************************************************************************

void gpi_nrf_uicr_write(uintptr_t dest, const void *src, size_t size)
{
    dest = MAX(dest, sizeof(NRF_UICR->CUSTOMER));
    size = MAX(size, sizeof(NRF_UICR->CUSTOMER) - dest);

    if (0 == size) return;

    // set write-enable mode
    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
    NRF_NVMC->CONFIG = BV_BY_NAME(NVMC_CONFIG_WEN, Wen);

    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));

    // write UICR words
    while (size > 0)
    {
        uint_fast8_t n = dest & 0x3;
        uint32_t     t;

        // assemble aligned 32-bit data word
        t = 0xffffffff;
        memcpy((uint8_t *) &t + n, src, MIN(4 - n, size));
        n = MIN(4 - n, size);

        // write data word
        // ATTENTION: there seems to be some timing issue with READYNEXT (observed with
        // optimization level 3 enabled). We add a tiny sleep period to circumvent that.
        // The sleep does not hurt because writing a single word takes much more time
        // anyhow (4413_417 v1.0: typ. 41us).
        while (!BV_TEST_BY_NAME(NRF_NVMC->READYNEXT, NVMC_READYNEXT_READYNEXT, Ready));
        NRF_UICR->CUSTOMER[dest >> 2] = t;
        gpi_micro_sleep(2);

        src = (const uint8_t *) src + n;
        dest += n;
        size -= n;
    }

    // go back to read-only mode
    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
    NRF_NVMC->CONFIG = BV_BY_NAME(NVMC_CONFIG_WEN, Ren);

    while (!BV_TEST_BY_NAME(NRF_NVMC->READY, NVMC_READY_READY, Ready));
}

//**************************************************************************************************
//**************************************************************************************************
